LEXICON_RU: dict[str, str] = {
    '/start': '<b>Привет!</b>\nДобро пожаловать в "Квиз-Приз"\n'
              'Здесь вы сможете проверить свои знания, участвовать '
              'в увлекательных викторинах и зарабатывать призы! 🏆 \n'
              'Готовы начать? \n'
              'Выбирайте в какой Лиге хотите участвовать и погружайтесь в мир увлекательных '
              'викторин и денежных призов! 🚀\n'
              '<b>Удачи!</b> 🍀\n'
              'Чтобы ознакомиться с правилами  нажимай команду /help \n\n'
              '<b>Играем?</b>'
    ,
    '/help': 'Как это работает: \n'
              ' 1. В любой из трех лиг (Бронзовой, Серебряной или Золотой) '
              'Вам будет предложено 15 вопросов возрастающей '
              'сложности и 4 варианта ответа, из которых нужно выбрать один. \n'
              'Все управление осуществляется с клавиатуры в нижней части экрана. '
              'Также у Вас будут подсказки: \n'
              'Убрать два неверных ответа (🆘) \n '
              'Застраховать сумму(🔰) \n'
              'Воcпользоваться правом на ошибку (✳️) \n'
              'Забрать выигранные баллы(💰).\n'
              '2. Зарабатывайте баллы (💰) в бронзовой лиге и займите в дневном рейтинге призовые места'
              'за которые вам будут начислены серебряные монеты для доступа к следующей лиге. Также Вы можете '
              'пополнить свой баланс и обменять рубли на серебряные или золотые монеты. \n'
              '3. По итогам недельного рейтинга в Серебряной и Золотой лиге будут разыгрываться'
              'денежные призы, которые поступят на баланс в личном кабинете и вы сможете'
              'их вывести любым удобным способом. \n',
    'welcome_bronze_league': 'Добро пожаловать в "Бронзовую Лигу"! \n'
                             'Для начала игры нажмите кнопку "Играть". В этой лиге будет 15 вопросов и у каждого '
                             '4 варианта, выберите один вариант. На каждый вопрос дается 60 секунд.'
                             'На каждую игру у Вас есть 4 "подсказки": \n'
                             '-🆘 убрать 1 неправильный ответ (убирает один из трех неправильных ответов) \n'
                             '-🔰 застраховать (страхует текущую сумму выигранных монет) \n'
                             '-✳️ право на ошибку (используется в случае неправильного ответа) \n'
                             '-💰 забрать выигранные монеты (можно в любой момент забрать выигранные монеты) \n'
                             'В этой лиге Вы можете зарабатывать серебрянные монеты "IQ Coins", которые понадобятся'
                             'для участия в "Серебрянной Лиге" нашей игры',
    'welcome_silver_league': 'Добро пожаловать в "Серебрянную Лигу"! \n'
                             'Для начала игры нажмите кнопку "Играть". В этой лиге будет 15 вопросов и у каждого '
                             '4 варианта, выберите один вариант. На каждый вопрос дается 50 секунд.'
                             'На каждую игру у Вас есть 4 "подсказки": \n'
                             '-🆘 убрать 1 неправильный ответ (убирает один из трех неправильных ответов) \n'
                             '-🔰 застраховать (страхует текущую сумму выигранных монет) \n'
                             '-✳️ право на ошибку (используется в случае неправильного ответа) \n'
                             '-💰 забрать выигранные монеты (можно в любой момент забрать выигранные монеты) \n'
                             'В этой лиге Вы можете зарабатывать золотые монеты "IQ Coins", которые понадобятся'
                             'для участия в "Золотой Лиге" нашей игры',
    'welcome_gold_league': 'Добро пожаловать в "Золотую Лигу"! \n'
                             'Для начала игры нажмите кнопку "Играть". В этой лиге будет 15 вопросов и у каждого '
                             '4 варианта, выберите один вариант. На каждый вопрос дается 40 секунд.'
                             'На каждую игру у Вас есть 4 "подсказки": \n'
                             '-🆘 убрать 1 неправильный ответ (убирает один из трех неправильных ответов) \n'
                             '-🔰 застраховать (страхует текущую сумму выигранных монет) \n'
                             '-✳️ право на ошибку (используется в случае неправильного ответа) \n'
                             '-💰 забрать выигранные монеты (можно в любой момент забрать выигранные монеты) \n'
                             'В этой лиге Вы сражаетесь за рейтинг среди других участников, лучшие три места '
                             'в рейтинге по итогу недели разделят призовой фонд нашей игры: \n'
                             '🥇 первое место 50% призового фонда \n'
                             '🥈 второе место 30% призового фонда \n'
                             '🥉 третье место 20% призового фонда',
    'delete_answer': '🆘 убрать не правильный',
    'insurance': '🔰 застраховать',
    'mistake': '✳️ право на ошибку',
    'take_prize': '💰 забрать',
    'bronze_league': '🥉 Лига',
    'silver_league': '🥈 Лига',
    'gold_league': '🥇 Лига',
    'A': 'A',
    'B': 'B',
    'C': 'C',
    'D': 'D',
    'account': 'Личный кабинет',
    'suggest_question': 'Предложить свой вопрос',
    'balance': 'Баланс',
    'bn_help': 'Помощь',
    'yes': 'Отлично! Делай свой выбор!',
    'no': 'Жаль...\nЕсли захочешь сыграть, просто разверни '
          'клавиатуру и нажми кнопку "Давай!"',
    'bot_won': 'Я победил!\n\nСыграем еще?',
    'user_won': 'Ты победил! Поздравляю!\n\nДавай сыграем еще?',
    'nobody_won': 'Ничья!\n\nПродолжим?',
    'bot_choice': 'Мой выбор',
    'other_answer': 'Потом добавить',
    'add_question': 'Добавить вопрос',
    'show_statistic': 'Показать статистику бота',
    'send_message': 'Отправить сообщение пользователям',
    'edit_quiz': 'Редактор квизов',
    'start_game': 'Начать игру',
    'back': 'Назад',
    'add': 'Добавить',
    'cancel': 'Отмена',
    'write_your_message': 'Напишите ваше сообщение',
    'write_your_question': 'Напишите текст вопроса',
    'correct_answer': 'Напишите правильный ответ',
    'answer_var2': 'Напишите второй вариант ответа',
    'answer_var3': 'Напишите третий вариант ответа',
    'answer_var4': 'Напишите четвертый вариант ответа',
    'add_question?': 'Добавить вопрос?',
    'check_and_add_question': 'Вопрос готов, добавить его в базу?',
    'db_success': 'Вопрос успешно добавлен в базу вопросов',
    'question_added': 'Добавление вопроса:',
    'db_error': 'Не удалось добавить вопрос в базу вопросов',
    'send_league': 'Выберите лигу',
    'bot_statistics': 'Статистика бота:',
    'send_level_question': 'Выберите уровень сложности вопроса',
    'level_1': 'Уровень 1',
    'level_2': 'Уровень 2',
    'level_3': 'Уровень 3'
}
LEXICON_COMMANDS_RU: dict[str, str] = {
    '/start': 'Запустить бота',
    '/account': 'Личный кабинет',
    '/balance': 'Баланс',
    '/payment': 'Оплата',
    '/help': 'Правила'
}
