LEXICON_RU: dict[str, str] = {
    '/start': '<b>Привет!</b>\nДобро пожаловать в "Квиз-Приз"\n'
              'Здесь вы сможете проверить свои знания, участвовать '
              'в увлекательных викторинах и зарабатывать призы! 🏆 \n'
              'Готовы начать? \n'
              'Выбирайте в какой Лиге хотите участвовать и погружайтесь в мир увлекательных '
              'викторин и денежных призов! 🚀\n'
              '<b>Удачи!</b> 🍀\n'
              'Чтобы ознакомиться с правилами  нажимай команду /help \n\n'
              '<b>Играем?</b>'
    ,
    '/help': 'Как это работает: \n'
              ' 1. В бронзовой лиге Вам будет предложено 15 вопросов возрастающей '
              'сложности и 4 варианта ответа, из которых нужно выбрать один. \n'
              'Все управление осуществляется с клавиатуры в нижней части экрана:'
              'Вы можете убрать два неверных ответа (🆘), застраховать сумму(🔰),'
              'воcпользоваться правом на ошибку (✳️). На каждую игру даётся по одной'
              'подсказке, дополнительные подсказки вы можете купить в магазине.'
              'Также на любом вопросе вы можете забрать выигранные монеты(💰).\n'
              ' 2. Зарабатывайте монеты (💰) в бронзовой лиге и обменивайте эти монеты на '
              'бриллианты (💎) для доступа к игре в серебряной лиге.'
              'А также первые три места в рейтинге бронзовой лиги по итогам недели '
              'получают доступ к одной игре в серебрянной лиге. \n'
              ' 3. По итогам недельного рейтинга в серебряной лиге будут разыгрываться'
              'денежные призы, которые поступят на баланс в личном кабинете и вы сможете'
              'их вывести любым удобным способом. \n\n',

    'delete_answer': '🆘 убрать не правильный',
    'insurance': '🔰 застраховать',
    'mistake': '✳️ право на ошибку',
    'take_prize': '💰 забрать',
    'bronze_league': '🥉 Лига',
    'silver_league': '🥈 Лига',
    'gold_league': '🥇 Лига',
    'A': 'A',
    'B': 'B',
    'C': 'C',
    'D': 'D',
    'account': 'Личный кабинет',
    'suggest_question': 'Предложить свой вопрос',
    'balance': 'Баланс',
    'bn_help': 'Помощь',
    'yes': 'Отлично! Делай свой выбор!',
    'no': 'Жаль...\nЕсли захочешь сыграть, просто разверни '
          'клавиатуру и нажми кнопку "Давай!"',
    'bot_won': 'Я победил!\n\nСыграем еще?',
    'user_won': 'Ты победил! Поздравляю!\n\nДавай сыграем еще?',
    'nobody_won': 'Ничья!\n\nПродолжим?',
    'bot_choice': 'Мой выбор',
    'other_answer': 'Потом добавить',
    'add_question': 'Добавить вопрос',
    'show_statistic': 'Показать статистику бота',
    'send_message': 'Отправить сообщение пользователям',
    'edit_quiz': 'Редактор квизов',
    'back': 'Назад',
    'add': 'Добавить',
    'cancel': 'Отмена',
    'write_your_message': 'Напишите ваше сообщение',
    'write_your_question': 'Напишите текст вопроса',
    'correct_answer': 'Напишите правильный ответ',
    'answer_var2': 'Напишите второй вариант ответа',
    'answer_var3': 'Напишите третий вариант ответа',
    'answer_var4': 'Напишите четвертый вариант ответа',
    'add_question?': 'Добавить вопрос?',
    'check_and_add_question': 'Вопрос готов, добавить его в базу?',
    'db_success': 'Вопрос успешно добавлен в базу вопросов',
    'question_added': 'Добавление вопроса:',
    'db_error': 'Не удалось добавить вопрос в базу вопросов',
    'send_league': 'Выберите лигу',
    'bot_statistics': 'Статистика бота:',
    'send_level_question': 'Выберите уровень сложности вопроса',
    'level_1': 'Уровень 1',
    'level_2': 'Уровень 2',
    'level_3': 'Уровень 3'
}
LEXICON_COMMANDS_RU: dict[str, str] = {
    '/start': 'Запустить бота',
    '/account': 'Личный кабинет',
    '/balance': 'Баланс',
    '/payment': 'Оплата',
    '/help': 'Правила'
}
